# 【期間限定】エクスペリエンスチケット
experience_ticket= {

    # Illustrator エクスペリエンスチケット
    'illustrator_ex': [
        "第1回 1_Illustratorでできること",
        "第2回 2_図形の描画（1）",
        "第3回 3_図形の描画（2）",
        "第4回 4_ペンツールを使ったパスの描画",
        "第5回 Ex課題",
    ],

    # Photoshop エクスペリエンスチケット
    'photoshop_ex': [
        "第1回 1_Photoshopでできること",
        "第2回 2_切り抜き、角度補正、カンバスの追加",
        "第3回 3_色調補正",
        "第4回 4_色の設定とペイント",
        "第5回 Ex課題",
    ],

    # AutoCAD エクスペリエンスチケット
    'autocad_ex': [
        "第1回 1_AutoCADの基本操作",
        "第2回 2_AutoCAD 作図補助設定",
        "第3回 3_基準線と曲線の作図",
        "第4回 4_複雑なオブジェクトの作図",
        "第5回 Ex課題",
    ],

    # Jw_cad エクスペリエンスチケット
    'jw_cad_ex': [
        "第1回 1_Jw_cadの基本操作と線",
        "第2回 2_基準線と曲線の作図",
        "第3回 3_複雑なオブジェクトの作図",
        "第4回 4_文字と表の作成とオブジェクト編集",
        "第5回 Ex課題",
    ],

    # Javaエンジニア エクスペリエンスチケット
    'java_ex': [
        "第1回 01_Javaの歴史_意識してほしいこと_AI活用方法 ※課題無し",
        "第2回 03_HelloWorldの解説",
        "第3回 04_変数と値の取り扱い_簡単な計算",
        "第4回 05_基本型_標準API_分岐処理(1)",
        "第5回 1on1",
    ],

    # Web制作プロフェッショナル エクスペリエンスチケット
    'web_ex': [
        "第1回 3_マークアップトレーニング1",
        "第2回 4_マークアップトレーニング1・2",
        "第3回 5_マークアップトレーニング2・3",
        "第4回 6_マークアップトレーニング3",
        "第5回 1on1",
    ],

    # Excel エクスペリエンスチケット
    'excel_ex': [
        "第1回 4_率の良いデータ入力方法",
        "第2回 5_計算機能",
        "第3回 6_関数1",
        "第4回 7_関数2",
        "第5回 定着テスト",
    ],

}