# Googleコース
google_course_options = {
    
    # ChatGPT
    'chatgpt_trial' : [
        "第1回 ChatGPTとは何かを知ろう",
        "第2回 ChatGPTで文章を作成してみよう",
        "第3回 ChatGPTをもっと使いこなそう",
    ],
    
    # Googleアプリトライアル
    'gat': [
        "第1回 ドキュメント、スプレッド",
        "第2回 スライド、フォーム",
        "第3回 その他アプリ",
    ],
    
    # Googleスプレッドシートスタンダード
    'gss': [
        "第1回 「インプット」の速度を上げる1",
        "第2回 「インプット」の速度を上げる2",
        "第3回 「アウトプット」の無駄をなくす1",
        "第4回 「アウトプット」の無駄をなくす2",
        "第5回 スプレッドシートの「Vlookup」を使い倒す1",
        "第6回 スプレッドシートの「Vlookup」を使い倒す2",
        "第7回 スプレッドシートの「Vlookup」を使い倒す3",
        "第8回 人に伝わるアウトプットに落とし込む1",
        "第9回 人に伝わるアウトプットに落とし込む2",
        "第10回 「シェア」でチームの生産性をアップさせる1",
        "第11回 「シェア」でチームの生産性をアップさせる2",
        "第12回 「シェア」でチームの生産性をアップさせる3",
    ],
    
    # GASトライアル
    'gas_trial': [
        "第1回 GASの基本知識",
        "第2回 今日から使える自動化サンプルスクリプト1",
        "第3回 今日から使える自動化サンプルスクリプト2",
        "第4回 今日から使える自動化サンプルスクリプト3",
        "第5回 今日から使える自動化サンプルスクリプト4",
        "第6回 スプレッドシートでお問い合わせボットをつくる",
    ],
    
    # GASベーシック
    'gas_basic': [
        "第1回 GASとは？",
        "第2回 基本構文1",
        "第3回 基本構文2",
        "第4回 制御構文",
        "第5回 関数",
        "第6回 クラスオブジェクト",
        "第7回 JavaScriptの取り込みオブジェクト1",
        "第8回 JavaScriptの取り込みオブジェクト2",
        "第9回 JavaScriptの取り込みオブジェクト3",
        "第10回 スプレッドシート1",
        "第11回 スプレッドシート2",
        "第12回 演習課題",
    ],

    # GASスタンダード
    'gas_standard': [
        "第1回 Gmail",
        "第2回 ドライブ",
        "第3回 カレンダー",
        "第4回 ドキュメント",
        "第5回 スライド",
        "第6回 フォーム",
        "第7回 翻訳・Baseサービス",
        "第8回 ユーザーインターフェース・ファイルとデータの操作",
        "第9回 Utilitiesサービス・プロパティサービス",
        "第10回 イベントとトリガー",
        "第11回 外部サイトへのアクセス・ライブラリ",
        "第12回 演習課題",
    ],
    
    # AppSheetトライアル
    'appsheet_trial' : [
        "第1回 はじめてのAppSheet利用",
        "第2回 テーブル編（１）",
        "第3回 テーブル編（２）・UX編",
        "第4回 UX編（２）・アプリ制作演習",
        "第5回 アプリ制作演習（２）",
        "第6回 アプリ制作演習（３）",
    ],    
}