office_course_options = {
    
    'wordBasic': [
        "第1回　Wordの基本操作",
        "第2回　文書体裁を整える（１）",
        "第3回　文書体裁を整える（２）",
        "第4回　ページを構成する機能",
        "第5回基本的な表の作成",
        "Lv1 定着テスト",
        "第6回　応用的な表の作成（１）",
        "第7回　応用的な表の作成（２）",
        "第8回　図の挿入と編集",
        "第9回　図形の挿入と編集",
        "第10回　SmartArtとワードアートの挿入と編集",
        "Lv2 定着テスト"	
    ],
    
    'wordAdvance': [
        "第1回　見栄えの良い文書の作成（1）",
        "第2回　見栄えの良い文書の作成（2）",
        "第3回　レイアウトを意識した文書の作成（1）",
        "第4回　レイアウトを意識した文書の作成（2）",
        "第5回　Word の応用操作を身につける",
        "Lv3 定着テスト",
        "第6回　図形を駆使した文書作成",
        "第7回　第3回　図解表現で魅せる文書",
        "第8回　様々な印刷方法",
        "第9回　効率的な長文の文書作成",
        "第10回　校正・校閲作業",
        "Lv4 定着テスト" 
    ],
    
    'excelBasic': [
        "第1回　Excelの基本操作",
        "第2回　書式設定1（リボン）",
        "第3回　書式設定2（ダイアログボックス）",
        "第4回　効率の良いデータ入力方法",
        "第5回　計算機能",
        "Lv1 定着テスト",
        "第6回　関数1",
        "第7回　関数2",
        "第8回　関数3",
        "第9回　グラフとオブジェクト",
        "第10回　データベース",
        "Lv2 定着テスト"
    ],
    
    'excelAdvance': [
        "第1回　論理関数と情報関数",
        "第2回　文字列操作関数",
        "第3回　日付/時刻関数",
        "第4回　検索/行列関数",
        "第5回　データベース関数と統計関数",
        "Lv3 定着テスト",
        "第6回　データの集計機能",
        "第7回　データの可視化機能",
        "第8回　What-If 分析機能",
        "第9回　外部データの利用",
        "第10回　校閲機能とマクロ",
        "Lv4 定着テスト"
    ],
    
    'powerPointBasic': [
        "第1回　PowerPointの基本操作",
        "第2回　スライドの編集と画像の挿入",
        "第3回　図形の挿入と編集",
        "第4回　図形の編集とワードアートの挿入",
        "第5回　第3回　SmartArtグラフィックの挿入と編集",
        "Lv1 定着テスト",
        "第6回　表の挿入と編集",
        "第7回　グラフの挿入と編集",
        "第8回　画面切り替え効果",
        "第9回　アニメーションの設定と編集",
        "第10回　スライドマスターの編集と印刷",
        "Lv2 定着テスト"
    ],
    
    'powerPointAdvance': [
        "第1回　オリジナルレイアウトの作成とコメント機能",
        "第2回　高度な書式設定",
        "第3回　オブジェクトの編集",
        "第4回　SmartArt グラフィックの挿入と編集",
        "第5回　表とグラフの挿入と編集",
        "Lv3 定着テスト",
        "第6回　アニメーションの設定",
        "第7回　プレゼンテーションの準備",
        "第8回　PowerPoint の応用操作(1)",
        "第9回　PowerPoint の応用操作(2)",
        "第10回　PowerPoint で印刷物をつくる",
        "Lv4 定着テスト"
    ],
    
    'accessBasic': [
        "第1回　Access の基本",
        "第2回　テーブルの作成",
        "第3回　クエリの作成",
        "第4回　フォームとレポートの作成",
        "第5回　ウィザードの利用",
        "マイルストーンテスト Level3",
        "第6回　便利なプロパティの設定",
        "第7回　便利なクエリの作成",
        "第8回　詳細なフォームの作成",
        "第9回　詳細なレポートの作成",
        "第10回　リレーショナルデータベース",
        "マイルストーンテスト Level4"
    ],
    
    'accessAdvance': [
        "第1回　応用的なフォームの作成",
        "第2回　応用的なレポートの作成",
        "第3回　アクションクエリ",
        "第4回　マクロ",
        "第5回　リレーションシップの応用",
        "マイルストーンテスト Level1",
        "第6回　応用的な関数の利用",
        "第7回　応用的なコントロールの利用",
        "第8回　応用的なマクロの利用1",
        "第9回　応用的なマクロの利用2",
        "第10回　データベースの管理機能",
        "マイルストーンテスト Level2"
    ]
    
}