# Officeコース
office_course_options = {
    
    # Wordベーシック
    'word_basic': [
        "第1回 Wordの基本操作",
        "第2回 文書体裁を整える（１）",
        "第3回 文書体裁を整える（２）",
        "第4回 ページを構成する機能",
        "第5回基本的な表の作成",
        "Lv1 定着テスト",
        "第6回 応用的な表の作成（１）",
        "第7回 応用的な表の作成（２）",
        "第8回 図の挿入と編集",
        "第9回 図形の挿入と編集",
        "第10回 SmartArtとワードアートの挿入と編集",
        "Lv2 定着テスト"	
    ],
    
    # Wordアドバンス
    'word_advance': [
        "第1回 見栄えの良い文書の作成（1）",
        "第2回 見栄えの良い文書の作成（2）",
        "第3回 レイアウトを意識した文書の作成（1）",
        "第4回 レイアウトを意識した文書の作成（2）",
        "第5回 Word の応用操作を身につける",
        "Lv3 定着テスト",
        "第6回 図形を駆使した文書作成",
        "第7回 第3回 図解表現で魅せる文書",
        "第8回 様々な印刷方法",
        "第9回 効率的な長文の文書作成",
        "第10回 校正・校閲作業",
        "Lv4 定着テスト" 
    ],
    
    # Excelベーシック
    'excel_basic': [
        "第1回 Excelの基本操作",
        "第2回 書式設定1（リボン）",
        "第3回 書式設定2（ダイアログボックス）",
        "第4回 効率の良いデータ入力方法",
        "第5回 計算機能",
        "Lv1 定着テスト",
        "第6回 関数1",
        "第7回 関数2",
        "第8回 関数3",
        "第9回 グラフとオブジェクト",
        "第10回 データベース",
        "Lv2 定着テスト"
    ],
    
    # Excelベーシック
    'excel_advance': [
        "第1回 論理関数と情報関数",
        "第2回 文字列操作関数",
        "第3回 日付/時刻関数",
        "第4回 検索/行列関数",
        "第5回 データベース関数と統計関数",
        "Lv3 定着テスト",
        "第6回 データの集計機能",
        "第7回 データの可視化機能",
        "第8回 What-If 分析機能",
        "第9回 外部データの利用",
        "第10回 校閲機能とマクロ",
        "Lv4 定着テスト"
    ],
    
    # PowerPointベーシック
    'powerpoint_basic': [
        "第1回 PowerPointの基本操作",
        "第2回 スライドの編集と画像の挿入",
        "第3回 図形の挿入と編集",
        "第4回 図形の編集とワードアートの挿入",
        "第5回 SmartArtグラフィックの挿入と編集",
        "Lv1 定着テスト",
        "第6回 表の挿入と編集",
        "第7回 グラフの挿入と編集",
        "第8回 画面切り替え効果",
        "第9回 アニメーションの設定と編集",
        "第10回 スライドマスターの編集と印刷",
        "Lv2 定着テスト"
    ],
    
    # PowerPointアドバンス
    'powerpoint_advance': [
        "第1回 オリジナルレイアウトの作成とコメント機能",
        "第2回 高度な書式設定",
        "第3回 オブジェクトの編集",
        "第4回 SmartArt グラフィックの挿入と編集",
        "第5回 表とグラフの挿入と編集",
        "Lv3 定着テスト",
        "第6回 アニメーションの設定",
        "第7回 プレゼンテーションの準備",
        "第8回 PowerPoint の応用操作(1)",
        "第9回 PowerPoint の応用操作(2)",
        "第10回 PowerPoint で印刷物をつくる",
        "Lv4 定着テスト"
    ],
    
    # Accessベーシック
    'access_basic': [
        "第1回 Access の基本",
        "第2回 テーブルの作成",
        "第3回 クエリの作成",
        "第4回 フォームとレポートの作成",
        "第5回 ウィザードの利用",
        "マイルストーンテスト Level1",
        "第6回 便利なプロパティの設定",
        "第7回 便利なクエリの作成",
        "第8回 詳細なフォームの作成",
        "第9回 詳細なレポートの作成",
        "第10回 リレーショナルデータベース",
        "マイルストーンテスト Level2"
    ],
    
    # Accessアドバンス
    'access_advance': [
        "第1回 応用的なフォームの作成",
        "第2回 応用的なレポートの作成",
        "第3回 アクションクエリ",
        "第4回 マクロ",
        "第5回 リレーションシップの応用",
        "マイルストーンテスト Level3",
        "第6回 応用的な関数の利用",
        "第7回 応用的なコントロールの利用",
        "第8回 応用的なマクロの利用1",
        "第9回 応用的なマクロの利用2",
        "第10回 データベースの管理機能",
        "マイルストーンテスト Level4"
    ],

    # ピボット実践
    'pivot_tables' : [
        "第1回 データソースの編集",
        "第2回 ラベル編集・並べ替え",
        "第3回 ピボットテーブルの計算機能",
        "第4回 デザイン・グラフ・レポート",
        "第5回 総合演習問題A",
        "第5回 総合演習問題B",
    ],

    # VBAアドバンスド
    'vba_advanced' : [
        "第1章 1-1 STEP1 VBAの基本用語を確認する",
        "第1章 1-2 STEP2 変数と定数を利用する",
        "第1章 1-3 STEP3 制御構造を利用する",
        "第1章 1-4 STEP4 配列を利用する",
        "第1章 1-5 STEP5 サブルーチンを利用する",
        "第2章 1-6 STEP1 セルを操作する",
        "第2章 1-7 STEP2 ワークシートを操作する",
        "第2章 2-1 STEP3 ブックを操作する",
        "第3章 2-2 STEP1 関数の基本を確認する",
        "第3章 2-3 STEP2 文字列操作関数を利用する",
        "第3章 2-4 STEP3 日付関数を利用する",
        "第3章 2-5 STEP4 その他の関数を利用する",
        "第3章 2-6 STEP5 ワークシート関数を利用する",
        "第3章 2-7 練習問題",
        "第4章 3-1 STEP1 イベントの基本を確認する",
        "第4章 3-2 STEP2 シートのイベントを利用する",
        "第4章 3-3 STEP3 ブックのイベントを利用する",
        "第5章 4-1 STEP1 ユーザーフォームの基本を確認する",
        "第5章 4-2 STEP2 ユーザーフォームを追加する",
        "第5章 4-3 STEP3 コントロールを追加する",
        "第5章 4-4 STEP4 ユーザーフォームの外観を整える",
        "第5章 4-5 STEP5 プロシージャを作成する",
        "第6章 5-1 STEP1 ファイルシステムオブジェクトの基本を確認する",
        "第6章 5-2 STEP2 FSOを使ってフォルダーやファイルを操作する",
        "第6章 5-3 STEP3 FSOを使ってテキストファイルを操作する",
        "第6章 5-4 練習問題",
        "第7章 6-1 STEP1 実行時エラーを処理する",
        "第7章 6-2 STEP2 デバッグ機能を利用する",
        "第8章 7-1 STEP1 商品売上システムの概要を確認する",
        "第8章 7-2 STEP2 マスタ登録処理を作成する",
        "第8章 7-3 STEP3 売上データ入力処理を作成する",
        "第8章 8-1 STEP4 請求書発行処理を作成する",
        "第8章 8-2 STEP5 システムを仕上げる",
        "9-1 総合問題1",
        "9-2 総合問題2",
        "10-1 総合問題3",
        "10-2 総合問題4"
    ],

    # マクロ実践
    'macro_practice' : [
        "第1回 マクロの記録",
        "第2回 マクロの編集（１）",
        "第3回 マクロの編集（２）",
        "第4回 マクロの編集（３）",
        "第5回 総合演習問題",
    ],

    # VBA実践
    'vba_practice' : [
        "第1回 機能1. 点数集計",
        "第1回 機能2. ランク付け",
        "第2回 機能1. 評価表示",
        "第2回 機能2. 合計集計",
        "第3回 機能1. カレンダー作成",
        "第3回 機能2. 予約追加",
        "第3回 機能3. 予約削除",
        "第4回 機能1. 月別予約管理情報集計",
        "第4回 機能2. 宿泊者予約管理情報集計",
    ],

    # スキルアップVBA
    'skills_up_vba' : [
        "第1回 1.VBAの基本",
        "第2回 2.プロパティとは",
        "第3回 3.変数の利用",
        "第4回 4.シートの操作",
        "第5回 5.ブックの操作",
        "第6回 6.For Nextステートメント",
        "第7回 7.Ifステートメント",
        "第8回 8.関数（日付と文字列操作の関数）",
        "第9回 9.関数（対話する関数）",
        "第10回 10.覚えておくと便利なメソッド",
        "第11回 11.覚えておくと便利なプロパティ",
        "第12回 12.VBEの便利な機能"
    ],

    # Excelパワークエリ
    'excel_power_query' : [
        "第1回 パワークエリとは何か？",
        "第1回 データソースへの接続",
        "第2回 データソースへの接続",
        "第3回 列と行の操作",
        "第4回 列と行の操作",
        "第5回 表をつなげる",
        "第6回 表をつなげる",
        "第7回 文字を整える",
        "第8回 文字を整える",
        "第9回 数字の計算と集計、日付・時刻・期間の計算、条件式",
        "第10回 数字の計算と集計、日付・時刻・期間の計算、条件式",
        "第11回 表の形を組み替える",
        "第12回 更なる活用に向けて",
    ],

    # Excelパワーピボット
    'excel_power_pivot' : [
        "第1回 Excelの常識を変えるモダンExcelの登場",
        "第1回 モダンExcelによる全自動レポートの仕組み",
        "第1回 まずは基本の星型で7つのステップをマスター",
        "第2回 まずは基本の星型で7つのステップをマスター",
        "第3回 まずは基本の星型で7つのステップをマスター",
        "第4回 商品別収益性分析",
        "第5回 商品別収益性分析",
        "第6回 商品カテゴリー・商品別の売上割合",
        "第7回 商品カテゴリー・商品別の売上割合",
        "第8回 当期累計売上",
        "第9回 売上前年比較",
        "第10回 予算VS実績比較",
        "第11回 予算VS実績比較",
        "第12回 ダッシュボード",
    ],

    # Accessクエリ活用
    'access_query_utilization' : [
        "第1回 1. 抽出に関するテクニック",
        "第2回 2. 集計に関するテクニック",
        "第3回 3. フィールドの計算に関するテクニック",
        "第4回 4. 時間・日付に関するテクニック",
        "第5回 5. 定義域集計関数を使用したテクニック"
    ],

    # Wordマスターブック
    'word_master_book' : [
        "第1回 車の歴史",
        "第2回 カレンダー",
        "第3回 京都の楽しみ方",
        "第4回 月次売上概況（速報）",
        "第5回 オペラハウスオープンのご案内",
        "第6回 真っ赤な国には青がある～Sports in Canada～",
        "第7回 災害時の備えについて",
        "第8回 子どもの食物アレルギー",
        "第9回 バースデーカード",
        "第10回 Treasure Hunting（宝探しゲーム）",
        "第11回 マウンテンバイクチーム会報",
        "第12回 サマーセールはがき",
        "第13回 学習システム「Happy Study」のご提案",
        "第14回 往復はがき（結婚式2次会のご案内）",
        "第15回 インターナショナルフードパーク",
    ],

    # Excelマスターブック
    'excel_master_book' : [
        "問題01 お菓子メーカー",
        "問題02 コンビニ",
        "問題03 賃貸住宅会社",
        "問題04 リサーチ会社",
        "問題05 ガソリンスタンド",
        "問題06 産業機械工場",
        "問題07 通信販売会社",
        "問題08 飲食店",
        "問題09 レンタルビデオ",
        "問題10 カメラ販売店",
        "問題11 食品加工会社",
        "問題12 教育出版社"
    ],

    # Accessビジネス活用
    'access_business' : [
        "第1章 Accessのビジネス活用",
        "第2章 商品管理",
        "第3章 商品管理～マクロ",
        "第4章 顧客管理",
        "第5章 顧客管理～マクロ",
        "第6章 売上管理",
        "第7章 売上管理～マクロ"
    ],

    # ベーシックExcel関数実践
    'basic_function' : [
        "第1回 計算の基本",
        "第2回 基本の関数",
        "第3回 数値を丸める関数",
        "第4回 順位を求める関数",
        "第5回 条件分岐の関数",
    ],
    
    # アドバンスExcel関数実践
    'advance_function' : [
        "第1回 論理関数と情報関数",
        "第2回 文字列操作関数",
        "第3回 日付/時刻関数",
        "第4回 検索/行列関数",
        "第5回 データベース関数と統計関数",
    ],
    
    # スキルアップExcel関数実践    
    'skill_function' : [
        "第1回 計算や集計を行う関数",
        "第2回 統計データを調べる関数",
        "第3回 条件を判断する関数",
        "第4回 日付を求める関数",
        "第5回 単位を変換する関数",
        "第6回 文字列を変換する関数",
        "第7回 文字列を検索・置換する関数",
        "第8回 セルの情報を表示する関数",
        "第9回 セル番地を表示・利用する関数",
        "第10回 配列数式の基本",
        "第11回 配列数式を使用する関数",
        "第12回 オリジナル関数を作成する",
    ],
    
    # ビジネスナレッジブックWord
    'business_knowledge_word' : [
        "第1回 ビジネス文書の基本",
        "第2回 伝わる文書",
        "第3回 魅せる文書",
        "第4回 効率化を意識した文書作成",
        "第5回 正しい文書保存",
    ],

    # ビジネスナレッジブックExcel
    'business_knowledge_excel' : [
        "第1回 データ活用の基礎知識",
        "第2回 データを読む",
        "第3回 データの視覚化",
        "第4回 データの集計",
        "第5回 データの分析",
    ],
    
    # ビジネスナレッジブックPowerPoint
    'business_knowledge_powerpoint' : [
        "第1回 プレゼンテーションの基本",
        "第2回 分かりやすいプレゼンテーション作成",
        "第3回 効率化を意識したプレゼンテーション",
        "第4回 思い通りのプレゼンテーションを作る",
        "第5回 プレゼンテーションに動きをつける",
    ],
    
    # Excel仕事術≪基本編≫
    'work_basic' : [
        "第1回 指示・依頼を正確に読み取るには？",
        "第2回 集めたデータに不備があるときは？",
        "第3回 データを効率的に利用するには？",
        "第4回 伝わる報告をせよ！",
        "第5回 マイルストーンテスト",
        "第6回 異なるデータを組み合わせて利用するときには？",
        "第7回 規模の違うデータを比較するには？",
        "第8回 データを判断材料に変えるには？",
        "第9回 業務での評価を高めるには？",
        "第10回 総合演習問題",
    ],
    
    # Excel仕事術≪応用編≫
    'work_application' : [
        "第1回 数式の結果が思い通りに出ない時には？",
        "第2回 データの不備をチェックするときには？",
        "第3回 異なるデータを組み合わせて利用するときには？",
        "第4回 効率的に集計を行うときには？",
        "第5回 マイルストーン",
        "第6回 上司から分析を依頼されたときには？",
        "第7回 複数の案から、最適な案を選ぶには？",
        "第8回 相手に伝わる資料を作成するには？",
        "第9回 ファイルを共有するときには？",
        "第10回 総合演習", 
    ],

    # Excel仕事術≪経理実務編≫
    'work_accounting' : [
        "第1回 Business Case 01",
        "第2回 Business Case 02",
        "第3回 Business Case 03",
        "第4回 Business Case 04",
        "第5回 Business Case 05",
        "第6回 Business Case 06",
        "第7回 Business Case 07",
        "第8回 Business Case 08_損益計算書（P/L）",
        "第9回 Business Case 09_損益計算書（B/S）",
        "第10回 総合演習問題",
    ],
        
    # Excel仕事術≪管理者実務編≫
    'work_administrator' : [
        "第1回 ナレッジ編 課題① リンク不動産",
        "第2回 ナレッジ編 課題② リンクキッチン",
        "第3回 ナレッジ編 課題③ リンクウォーター",
        "第4回 ナレッジ編 課題④ リンクステーショナリー",
        "第5回 実践編 課題① リンクカレー",
        "第6回 実践編 課題② リンクバーガー",
        "第7回 実践編 課題③ リンクスポーツ",
    ],
    
    # Excelデータ分析
    'data_analysis' : [
        "第1回 データとデータ分析",
        "第2回 データのまとめ方1 ～まとめ方の基本～",
        "第3回 データのまとめ方2 ～代表値～",
        "第4回 データのまとめ方3 ～散布度～",
        "第5回 ここまでのまとめ",
        "第6回 グラフの使い方1 ～度数・代表値の表現～",
        "第7回 グラフの使い方2 ～比率表現～",
        "第8回 データを読み解く1",
        "第9回 データを読み解く2",
        "第10回 総まとめ",
    ],
    
    # 伝わる提案書
    'proposal' : [
        "第1回 提案書作成の下ごしらえ",
        "第2回 提案書の構成作り",
        "第3回 伝わる提案書の作成",
        "第4回 提案書からプレゼン資料へ",
        "第5回 伝わるスライドから伝わるスライドへ",
    ],
    
    # 伝わる提案書（ドリル）
    'proposal_drill' : [
        "第1回 宿泊する旅館を選べ！",
        "第2回 どのシステムを導入すべき？",
        "第3回 老舗レストランの問題はどこにある？",
        "第4回 どのマンションを改修する？",
        "第5回 営業1課の成績をアップせよ！",
    ], 
    
    # ビジネス活用ドリルWord
    'business_drill_word' : [
        "第1回 授業課題（1）問題1 通知状（本社移転）",
        "第1回 授業課題（2）問題6 案内状（株主総会）",
        "第1回 トライ課題 問題5 案内状（新製品発表会）",
        "第2回 授業課題（1）問題13 見積書",
        "第2回 授業課題（2）問題24 報告（出張旅費精算）",
        "第2回 トライ課題 問題27 稟議書",
        "第3回 授業課題（1）問題36 企画（スポットオフィス設置）",
        "第3回 授業課題（2）問題47 ポスター（イベント参加者募集）",
        "第3回 トライ課題 問題48 ポスター（社内交流会のご案内）",
        "第4回 授業課題（1）問題25 連絡（社内セミナー開催のお知らせ）",
        "第4回 授業課題（2）問題16 依頼状（講演依頼）",
        "第4回 トライ課題 問題37 提案（在宅勤務制度改定）",
        "第5回 授業課題（1）問題29 社内報（けんぽ便り）",
        "第5回 授業課題（2）問題33 議事録（フェア企画会議）",
        "第5回 トライ課題 問題31 連絡（福利厚生施設）",
        "第6回 授業課題（1）問題50 ポスター（講習会参加者募集）",
        "第6回 授業課題（2）問題46 パンフレット（ボランティア募集）",
        "第6回 トライ課題 問題39 企画（新商品プロモーション）",
        "第7回 授業課題（1）問題12 FAX送付状",
        "第7回 授業課題（2）問題26 連絡（社員旅行のご案内）",
        "第7回 トライ課題 問題32 稟議書（プロジェクター購入）",
        "第8回 授業課題（1）問題2 あいさつ状（転勤あいさつはがき）",
        "第8回 授業課題（2）問題18 請求書",
        "第8回 トライ課題 問題8 あいさつ状（転職）",
        "第9回 授業課題（1）問題9 礼状（新商品発表会来場）",
        "第9回 授業課題（2）問題22 宛名ラベル",
        "第9回 トライ課題 問題40 企画（新サービス開始）",
        "第10回 授業課題（1）問題7 通知状（営業所統合）",
        "第10回 授業課題（2）問題43 提案（営業力強化研修）",
        "第10回 トライ課題 問題34 報告（市場調査結果）"
    ], 
    
    # ビジネス活用ドリルExcel   
    'business_drill_excel' : [
        "第1回 授業課題(1) 問題2 支店別売上実績表",
        "第1回 授業課題(2) 問題4 時間帯別顧客単価",
        "第1回 トライ課題 問題46 見積書",
        "第2回 授業課題(1) 問題17 研修会申込記録",
        "第2回 授業課題(2) 問題41 宿泊施設一覧",
        "第2回 トライ課題 問題42 売上台帳",
        "第3回 授業課題(1) 問題5 仕入予定表",
        "第3回 授業課題(2) 問題3 交通費清算書",
        "第3回 トライ課題 問題38 支払予定一覧表",
        "第4回 授業課題(1) 問題33 受注一覧(自動入力)",
        "第4回 授業課題(2) 問題37 出荷伝票(自動入力)",
        "第4回 トライ課題 問題34 受注一覧(自動入力)",
        "第5回 授業課題(1) 問題36 顧客満足度調査",
        "第5回 授業課題(2) 問題26 上半期売上実績",
        "第5回 トライ課題 問題44 社員満足度調査",
        "第6回 授業課題(1) 問題22 事業別売上高推移(棒グラフ)",
        "第6回 授業課題(2) 問題24 社員構成比率(円グラフ)",
        "第6回 トライ課題 問題8 新年度予算(季節指数計算)",
        "第7回 授業課題(1) 問題19 店舗別売上日報",
        "第7回 授業課題(2) 問題16 全店経費集計表(シートの統合)",
        "第7回 トライ課題 問題20 店舗別商品別売上集計(シートの統合)",
        "第8回 授業課題(1) 問題14 売上成績比較(クロス集計)",
        "第8回 授業課題(2) 問題18 アンケート集計(クロス集計)",
        "第8回 トライ課題 問題21 贈答品売上集計(3次元クロス集計)",
        "第9回 授業課題(1) 問題27 第2四半期売上集計(グラフ上での絞り込み)",
        "第9回 授業課題(2) 問題29 海外売上比率推移(複合グラフ)",
        "第9回 トライ課題 問題28 買上率(複合グラフ)",
        "第10回 授業課題(1) 問題35 会議室予約表(マクロの記録/登録)",
        "第10回 授業課題(2) 問題39 DVD売上ベスト10自動抽出(マクロ)"
    ], 
        
    # ビジネス活用ドリルPowerPoint
    'business_drill_powerpoint' : [
        "第1回 授業課題（1）問題2 社内資格制度合格発表",
        "第1回 授業課題（2）問題12 説明（会社概要とビジョン）",
        "第1回 トライ課題 問題6 告知（セミナーのご案内）",
        "第2回 授業課題（1）問題24 企画（創立十周年記念式典）",
        "第2回 授業課題（2）問題27 提案（社員報奨旅行）",
        "第2回 トライ課題 問題14 説明（海外派遣対象者選定の考え方）",
        "第3回 授業課題（1）問題10 案内（研修のご案内）",
        "第3回 授業課題（2）問題11 案内（新卒採用のご案内）",
        "第3回 トライ課題 問題13 説明（営業支援システム説明会）",
        "第4回 授業課題（1）問題9 パンフレット（セミナー案内）",
        "第4回 授業課題（2）問題3 掲示（CS行動指針）",
        "第4回 トライ課題 問題16 説明（PC師匠設定操作説明書）",
        "第5回 授業課題（1）問題35 掲示（観桜旅行の案内）",
        "第5回 授業課題（2）問題8 掲示（病院待合室ディスプレイ）",
        "第5回 トライ課題 問題29 提案（運営体制改善提案）",
        "第6回 授業課題（1）問題4 告知（社内英会話講座のお知らせ）",
        "第6回 授業課題（2）問題7 ポスター（海外業務研修生募集）",
        "第6回 トライ課題 問題15 報告（新入社員教育補足資料）",
        "第7回 授業課題（1）問題18 報告（社員満足度調査）",
        "第7回 授業課題（2）問題19 報告（第14期活動報告書）",
        "第7回 トライ課題 問題37 目的別プレゼン（入居手続き案内会）",
        "第8回 授業課題（1）問題26 提案（フリーアドレス導入）",
        "第8回 授業課題（2）問題34 目的別プレゼン（下期営業目標説明会）",
        "第8回 トライ課題 問題38 自動プレゼン（店舗フロア案内）",
        "第9回 授業課題（1）問題23 報告（トラブル報告書）",
        "第9回 授業課題（2）問題1 テンプレート（月度報告書）",
        "第9回 トライ課題 問題28 企画（環境マネジメント対策）",
        "第10回 授業課題（1）問題31 プレゼン（プレゼンテーション研修のご提案）",
        "第10回 授業課題（2）問題32 ノート（シュレッダーのご提案）",
        "第10回 トライ課題 問題30 提案（リゾートマンションのご提案）"
    ],                 
}