school_options = {
    # 校舎No 2024年6月
    '東日本第1': [
        "札幌大通校 137",
        "仙台駅前校 85",
        "福島校 103",
        "ララガーデン春日部校 79",
        "熊谷校 95",
        "川越校 131",
        "大宮校 400",
        "所沢校 134",
        "浦和パルコ校 122",
        "渋谷校 223",
        "池袋校 68",
        "新宿校 183",
        "銀座校 160"
    ],
    '東日本第2': [
        "柏駅前校 87",
        "錦糸町校 47",
        "上野校 318",
        "津田沼校 184",
        "大井町校 172",
        "吉祥寺駅前校 217",
        "立川校 56",
        "八王子オクトーレ校 410",
        "横浜校 59",
        "川崎ルフロン校 70",
        "上大岡校 175",
        "イオン海老名校 330",
        "溝の口校 166"
    ],
    '西日本第1': [
        "静岡モディ校 301",
        "東岡崎校 27",
        "金山校 1",
        "名古屋駅前校 3",
        "テックランド星ヶ丘校 22",
        "マーサ21校 176",
        "三ノ宮校 123",
        "ピオレ姫路校 333",
        "西宮北口校 347",
        "梅田校 73",
        "京都駅前校 143",
        "枚方校 114",
        "京橋校 125",
        "あべのキューズモール校 141",
        "なんば校 159"
    ],
    '西日本第2': [
        "福山校 272",
        "広島大手町校 420",
        "岡山駅前校 242",
        "高知校 425",
        "松山校 426",
        "徳島校 427",
        "小倉校 178",
        "天神校 205",
        "久留米校 431",
        "熊本校 407",
        "沖縄校 405"
    ],
    'クラウド': [
        "PCオンライン校 3001",
        "資格オンライン校 3001",
        "CloudSchool北海道 701",
        "CloudSchool東北 702",
        "CloudSchool中部 703",
        "CloudSchool関西 704",
        "CloudSchool関東 705",
        "CloudSchool中四国 706",
        "CloudSchool九州沖縄 707"
    ]
}
